---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.TextureRealWorldOffsetX
source: html/b9e5abcf-3667-0358-d79b-b7894a7b9bce.htm
---
# Autodesk.Revit.DB.Visual.Checker.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".